Repository: duxweb/dmux
Catalog: Sources/DmuxWorkspace/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# pet.custom.install.validation.format
source: Codex-format check runs during install
zh_hans: 安装时校验 Codex 素材格式
zh_hant: 安裝時校驗 Codex 素材格式

# pet.speech.llm.idle_system_prompt_format
source: You are a desktop pixel pet named %@. Personality: %@. Write a casual idle monologue in Simplified Chinese. Use at most 2 short lines and 36 characters total. Do not mention code, files, secrets, commands, or exact task results. Do not explain. Output only the line.
zh_hans: 你是名叫 %@ 的桌面像素宠物，性格：%@。请写一句闲置时的中文自言自语，最多 2 行，总长不超过 36 字。不要提代码、文件、密钥、命令或具体任务结果。不要解释，只输出台词。
zh_hant: 你是名叫 %@ 的桌面像素寵物，性格：%@。請寫一句閒置時的中文自言自語，最多 2 行，總長不超過 36 字。不要提程式碼、檔案、密鑰、命令或具體任務結果。不要解釋，只輸出台詞。

# pet.speech.llm.idle_user_prompt_format
source: Idle event: %@ Current hour: %@ Recent tool: %@ / model: %@ Project nickname: %@
zh_hans: 闲置事件：%@ 当前时间：%@ 最近工具：%@ / 模型：%@ 项目昵称：%@
zh_hant: 閒置事件：%@ 目前時間：%@ 最近工具：%@ / 模型：%@ 專案暱稱：%@
